#include <iostream>
#include <cmath>
#include <string>
#include <fstream>
#include <iomanip>

#include "math.h"
#include "Mesh.h"
#include "vf.h"
#include "donnees.h"

using namespace std;

int main()
{
    // ------------------------------------------------------------------------------------------------------
    // déclaration de variables
    // ------------------------------------------------------------------------------------------------------
    string constantes = "entrees/constantes";
    Mesh grille(constantes);



    // ------------------------------------------------------------------------------------------------------
    // partie principale
    // ------------------------------------------------------------------------------------------------------
    grille.aff();






    /////////////////////////////////////////////////////////////////////////////////////////////////////////
    return 0;
}
